//----------------------------------------------------------------------------

//Модуль управления вентилятором, заголовочный файл

//----------------------------------------------------------------------------

#ifndef FAN_H
#define FAN_H

//------------------------------- Константы: ---------------------------------

#define FAN_MIN_SPEED      25 //минимальная скорость вентилятора, %
#define FAN_MAX_SPEED     100 //максимальная скорость вентилятора, %
#define FAN_STARTUP_SPEED  70 //скорость старта вентилятора, %
#define FAN_MIN_RUN         5 //мин. время работы вентилятора после старта, с

//----------------------------------------------------------------------------
//------------------------------ Класс TFan: ---------------------------------
//----------------------------------------------------------------------------

class TFan
{
private:
  TGpio<PORTB, PIN14> Pin_FAN;
  uint8_t Speed;
  uint8_t State;
  uint8_t RunTimer;
  int32_t Reg_Out;
public:
  TFan(void);
  void Control(int16_t tl, int16_t th, int16_t tget);
  void SetSpeed(uint8_t p);
  uint8_t GetSpeed(void);
};

//----------------------------------------------------------------------------

#endif
