//----------------------------------------------------------------------------

//Модуль программной реализации шины I2C, заголовочный файл

//----------------------------------------------------------------------------

#ifndef I2CSW_H
#define I2CSW_H

//----------------------------- Константы: -----------------------------------

#define I2C_RD       1 //признак чтения данных по шине I2C
#define I2C_ACK      1 //признак передачи ACK
#define I2C_NACK     0 //признак передачи NACK

//----------------------------------------------------------------------------
//----------------------------- Класс TI2Csw: --------------------------------
//----------------------------------------------------------------------------

class TI2Csw
{
private:
  static TGpio<PORTB, PIN8> Pin_SCL; 
  static TGpio<PORTB, PIN9> Pin_SDA;
  static void BitDelay(void);
public:
  static void Init(void);
  static void Free(void);
  static void Start(void);
  static bool Write(char data);
  static char Read(bool ack);
  static void Stop(void);
};

//----------------------------------------------------------------------------

#endif
