//----------------------------------------------------------------------------

//Project:  PSL-3604
//Compiler: IAR EWARM 6.50
//Target:   STM32F100C8T6B

//----------------------------------------------------------------------------

#include "main.h"
#include "control.h"
#include "port.h"

//----------------------------- Переменные: ----------------------------------

TControl *Control;
TPort *Port;

//----------------------------------------------------------------------------
//------------------------- Основная программа: ------------------------------
//----------------------------------------------------------------------------

int main(void)
{
  TSysTimer::Init();        //инициализация системного таймера
  Control = new TControl(); //создание объекта управления
  Port = new TPort();       //создание объекта порта
  TSysTimer::SecReset();    //сброс секундного таймера
  
  do                        //основной цикл
  {
    TSysTimer::Sync();      //синхронизация системных тиков с основным циклом
    Control->Execute();     //выполнение местного управления
    Port->Execute();        //выполнение команд компьютера
  }
  while(1);
}

//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
//----------------------------------------------------------------------------
