//----------------------------------------------------------------------------

//Модуль поддержки последовательного регистра, заголовочный файл

//----------------------------------------------------------------------------

#ifndef SREG_H
#define SREG_H

//----------------------------------------------------------------------------
//----------------------------- Класс TSreg: ---------------------------------
//----------------------------------------------------------------------------

class TSreg
{
private:
  TGpio<PORTB, PIN3> Pin_SCLK; 
  TGpio<PORTB, PIN5> Pin_SDATA; 
  TGpio<PORTB, PIN6> Pin_LOAD; 
  TGpio<PORTB, PIN7> Pin_OE; 
  void SpiWr(uint8_t d);
public:
  TSreg(void) {};
  void Init(void);                  //инициализация SPI
  void operator = (uint32_t Value); //загрузка регистра
  void Enable(void);                //разрешение выходов регистра
  void Disable(void);               //запрещение выходов регистра
};

//----------------------------------------------------------------------------

#endif
